citiao1/my_code/智能车/STC32G12K128_BLDC_Project-master/【例程】控制无刷电机的示例/TC212/Seekfree_TC212_Brushless_Electric_Regulating_Demo/libraries/zf_driver/zf_driver_spi.c
            if      (SPI3_MOSI_P02_6  == mosi_pin)  set_pin->mtsr = &IfxQspi3_MTSR_P02_6_OUT;
            else if (SPI3_MOSI_P10_6  == mosi_pin)  set_pin->mtsr = &IfxQspi3_MTSR_P10_6_OUT;
            else    zf_assert(FALSE);

            if      (SPI3_MISO_P02_5  == miso_pin)  set_pin->mrst = &IfxQspi3_MRSTA_P02_5_IN;
            else    zf_assert(FALSE);

            if      (SPI3_CS0_P02_4   == cs_pin)    set_cs->pin   = &IfxQspi3_SLSO0_P02_4_OUT;
            else if (SPI3_CS1_P02_0   == cs_pin)    set_cs->pin   = &IfxQspi3_SLSO1_P02_0_OUT;
            else if (SPI3_CS1_P33_9   == cs_pin)    set_cs->pin   = &IfxQspi3_SLSO1_P33_9_OUT;
            else if (SPI3_CS2_P02_1   == cs_pin)    set_cs->pin   = &IfxQspi3_SLSO2_P02_1_OUT;
            else if (SPI3_CS2_P33_8   == cs_pin)    set_cs->pin   = &IfxQspi3_SLSO2_P33_8_OUT;
            else if (SPI3_CS3_P02_2   == cs_pin)    set_cs->pin   = &IfxQspi3_SLSO3_P02_2_OUT;
            else if (SPI3_CS4_P02_3   == cs_pin)    set_cs->pin   = &IfxQspi3_SLSO4_P02_3_OUT;
            else if (SPI3_CS5_P02_8   == cs_pin)    set_cs->pin   = &IfxQspi3_SLSO5_P02_8_OUT;
            else if (SPI3_CS6_P00_8   == cs_pin)    set_cs->pin   = &IfxQspi3_SLSO6_P00_8_OUT;
            else if (SPI3_CS7_P33_7   == cs_pin)    set_cs->pin   = &IfxQspi3_SLSO7_P33_7_OUT;
            else if (SPI3_CS8_P10_5   == cs_pin)    set_cs->pin   = &IfxQspi3_SLSO8_P10_5_OUT;
            else if (SPI3_CS11_P33_10 == cs_pin)    set_cs->pin   = &IfxQspi3_SLSO11_P33_10_OUT;
            else if (SPI3_CS13_P23_1  == cs_pin)    set_cs->pin   = &IfxQspi3_SLSO13_P23_1_OUT;
            else if (SPI_CS_NULL      == cs_pin)    set_cs->pin   = NULL_PTR;
            else    zf_assert(FALSE);
        }break;
    }
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介       SPI清除接收缓存区数据
// 参数说明       spi_n           SPI 模块号 参照 zf_driver_spi.h 内 spi_index_enum 枚举体定义
// 返回参数       void
// 使用示例       spi_clear_fifo(SPI_1);
// 备注信息       内部调用，用户无需关心
//-------------------------------------------------------------------------------------------------------------------
static void spi_clear_fifo (Ifx_QSPI *moudle)
{
    uint32 fifo_num;
    // 将之前fifo中的数据全读读取出来
    fifo_num = moudle->STATUS.B.RXFIFOLEVEL;
    while(fifo_num --)
    {
        (uint8)IfxQspi_readReceiveFifo(moudle);
    }

}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介       SPI 接口写 8bit 数据
// 参数说明       spi_n           SPI 模块号 参照 zf_driver_spi.h 内 spi_index_enum 枚举体定义
// 参数说明       data            数据
// 返回参数       void
// 使用示例       spi_write_8bit(SPI_1, 0x11);
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void spi_write_8bit (spi_index_enum spi_n, const uint8 data)
{
    volatile Ifx_QSPI *moudle;                                  // 定义SPI模块对象

    moudle = IfxQspi_getAddress((IfxQspi_Index)spi_n);          // 获取模块地址

    IfxQspi_writeBasicConfigurationEndStream(moudle, bacon[spi_n].U);  // 发送数据后CS拉高

    IfxQspi_writeTransmitFifo(moudle, data);                    // 将发送的数据写入缓冲区

    while(moudle->STATUS.B.TXFIFOLEVEL != 0);                   // 等待发送完毕

    while(moudle->STATUS.B.PT1F == 0);                          // 等待结束标志位

    IfxQspi_clearAllEventFlags(moudle);                         // 清除发送结束标志位
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介       SPI 接口写 8bit 数组
// 参数说明       spi_n           SPI 模块号 参照 zf_driver_spi.h 内 spi_index_enum 枚举体定义
// 参数说明       *data           数据存放缓冲区
// 参数说明       len             缓冲区长度
// 返回参数       void
// 使用示例       spi_write_8bit_array(SPI_1, data, 64);
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void spi_write_8bit_array (spi_index_enum spi_n, const uint8 *data, uint32 len)
{
    volatile Ifx_QSPI *moudle;                                  // 定义SPI模块对象

    moudle = IfxQspi_getAddress((IfxQspi_Index)spi_n);          // 获取模块地址

    IfxQspi_writeBasicConfigurationBeginStream(moudle, bacon[spi_n].U);// 发送数据后CS继续保持为低

    do
    {
        if(len == 1)
        {
            IfxQspi_writeBasicConfigurationEndStream(moudle, bacon[spi_n].U);  // 发送数据后CS拉高
        }

        IfxQspi_writeTransmitFifo(moudle, *data ++);                    // 将发送的数据写入缓冲区

        while(moudle->STATUS.B.TXFIFOLEVEL != 0);               // 等待发送完毕
    }while(-- len);

    while(moudle->STATUS.B.PT1F == 0);                          // 等待结束标志位

    IfxQspi_clearAllEventFlags(moudle);                         // 清除发送结束标志位
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介       SPI 接口写 16bit 数据
// 参数说明       spi_n           SPI 模块号 参照 zf_driver_spi.h 内 spi_index_enum 枚举体定义
// 参数说明       data            数据
// 返回参数       void
// 使用示例       spi_write_16bit(SPI_1, 0x1101);
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void spi_write_16bit (spi_index_enum spi_n, const uint16 data)
{
    volatile Ifx_QSPI *moudle;                                  // 定义SPI模块对象

    moudle = IfxQspi_getAddress((IfxQspi_Index)spi_n);          // 获取模块地址

    IfxQspi_writeBasicConfigurationBeginStream(moudle, bacon[spi_n].U);// 发送数据后CS继续保持为低

    IfxQspi_writeTransmitFifo(moudle, (uint8)((data & 0xFF00) >> 8)); // 将发送的数据写入缓冲区

    while(moudle->STATUS.B.TXFIFOLEVEL != 0);                   // 等待发送完毕

    IfxQspi_writeBasicConfigurationEndStream(moudle, bacon[spi_n].U);  // 发送数据后CS拉高

    IfxQspi_writeTransmitFifo(moudle, (uint8)(data & 0x00FF));  // 将发送的数据写入缓冲区

    while(moudle->STATUS.B.PT1F == 0);                          // 等待结束标志位

    IfxQspi_clearAllEventFlags(moudle);                         // 清除发送结束标志位
}


