citiao1/my_code/智能车/STC32G12K128_BLDC_Project-master/【例程】控制无刷电机的示例/TC212/Seekfree_TC212_Brushless_Electric_Regulating_Demo/libraries/zf_driver/zf_driver_spi.c
//-------------------------------------------------------------------------------------------------------------------
// 函数简介       SPI 接口向传感器的寄存器写 16bit 数组
// 参数说明       spi_n           SPI 模块号 参照 zf_driver_spi.h 内 spi_index_enum 枚举体定义
// 参数说明       register_name   寄存器地址
// 参数说明       *data           数据存放缓冲区
// 参数说明       len             缓冲区长度
// 返回参数       void
// 使用示例       spi_write_16bit_registers(SPI_1, 0x1011, data, 32);
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void spi_write_16bit_registers (spi_index_enum spi_n, const uint16 register_name, const uint16 *data, uint32 len)
{
    volatile Ifx_QSPI *moudle;                                  // 定义SPI模块对象

    moudle = IfxQspi_getAddress((IfxQspi_Index)spi_n);          // 获取模块地址

    IfxQspi_writeBasicConfigurationBeginStream(moudle, bacon[spi_n].U);// 发送数据后CS继续保持为低

    IfxQspi_writeTransmitFifo(moudle, (uint8)((register_name & 0xFF00) >> 8));  // 将发送的数据写入缓冲区

    while(moudle->STATUS.B.TXFIFOLEVEL != 0);                   // 等待发送完毕

    IfxQspi_writeTransmitFifo(moudle, (uint8)(register_name & 0x00FF));         // 将发送的数据写入缓冲区

    while(moudle->STATUS.B.TXFIFOLEVEL != 0);                   // 等待发送完毕

    do
    {
        IfxQspi_writeTransmitFifo(moudle, (uint8)((*data & 0xFF00) >> 8));      // 将发送的数据写入缓冲区

        while(moudle->STATUS.B.TXFIFOLEVEL != 0);               // 等待发送完毕

        if(len == 1)                                            // 最后一个数据
        {
           IfxQspi_writeBasicConfigurationEndStream(moudle, bacon[spi_n].U);           // 发送数据后CS拉高
        }

        IfxQspi_writeTransmitFifo(moudle, (uint8)(*data ++ & 0x00FF));          // 将发送的数据写入缓冲区

        while(moudle->STATUS.B.TXFIFOLEVEL != 0);               // 等待发送完毕

    }while(-- len);

    while(moudle->STATUS.B.PT1F == 0);                          // 等待结束标志位

    IfxQspi_clearAllEventFlags(moudle);                         // 清除发送结束标志位
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介       SPI 接口读 8bit 数据
// 参数说明       spi_n           SPI 模块号 参照 zf_driver_spi.h 内 spi_index_enum 枚举体定义
// 参数说明       register_name   寄存器地址
// 返回参数       uint8           数据
// 使用示例       spi_read_8bit(SPI_1);
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
uint8 spi_read_8bit (spi_index_enum spi_n)
{
    volatile Ifx_QSPI *moudle;                                  // 定义SPI模块对象

    moudle = IfxQspi_getAddress((IfxQspi_Index)spi_n);          // 获取模块地址

    IfxQspi_writeBasicConfigurationEndStream(moudle, bacon[spi_n].U);  // 发送数据后CS拉高

    spi_clear_fifo(moudle);                                     // 清除接收缓存区

    IfxQspi_writeTransmitFifo(moudle, 0);                       // 将发送的数据写入缓冲区

    while(moudle->STATUS.B.RXFIFOLEVEL == 0);                   // 等待接收完毕

    while(moudle->STATUS.B.PT1F == 0);                          // 等待结束标志位

    IfxQspi_clearAllEventFlags(moudle);                         // 清除发送结束标志位

    return (uint8)IfxQspi_readReceiveFifo(moudle);              // 返回接收到的数据
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介       SPI 接口读 8bit 数组
// 参数说明       spi_n           SPI 模块号 参照 zf_driver_spi.h 内 spi_index_enum 枚举体定义
// 参数说明       *data           数据存放缓冲区
// 参数说明       len             发送缓冲区长度
// 返回参数       void
// 使用示例       spi_read_8bit_array(SPI_1, data, 64);
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void spi_read_8bit_array (spi_index_enum spi_n, uint8 *data, uint32 len)
{
    volatile Ifx_QSPI *moudle;                                  // 定义SPI模块对象

    moudle = IfxQspi_getAddress((IfxQspi_Index)spi_n);          // 获取模块地址

    IfxQspi_writeBasicConfigurationBeginStream(moudle, bacon[spi_n].U);// 发送数据后CS继续保持为低

    spi_clear_fifo(moudle);                                     // 清除接收缓存区

    do
    {
        if(len == 1)                                            // 最后一个数据
        {
           IfxQspi_writeBasicConfigurationEndStream(moudle, bacon[spi_n].U);           // 发送数据后CS拉高
        }

        IfxQspi_writeTransmitFifo(moudle, 0);                   // 将发送的数据写入缓冲区

        while(moudle->STATUS.B.RXFIFOLEVEL == 0);               // 等待接收完毕

        *data++ = (uint8)IfxQspi_readReceiveFifo(moudle);       // 保存接收到的数据
    }while(-- len);

    while(moudle->STATUS.B.PT1F == 0);                          // 等待结束标志位

    IfxQspi_clearAllEventFlags(moudle);                         // 清除发送结束标志位
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介       SPI 接口读 16bit 数据
// 参数说明       spi_n           SPI 模块号 参照 zf_driver_spi.h 内 spi_index_enum 枚举体定义
// 参数说明       register_name   寄存器地址
// 返回参数       uint16          数据
// 使用示例       spi_read_16bit(SPI_1);
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
uint16 spi_read_16bit (spi_index_enum spi_n)
{
    uint16 data = 0;

    volatile Ifx_QSPI *moudle;                                  // 定义SPI模块对象

    moudle = IfxQspi_getAddress((IfxQspi_Index)spi_n);          // 获取模块地址

    IfxQspi_writeBasicConfigurationBeginStream(moudle, bacon[spi_n].U);// 发送数据后CS继续保持为低

    spi_clear_fifo(moudle);                                     // 清除接收缓存区

    IfxQspi_writeTransmitFifo(moudle, 0);                       // 将发送的数据写入缓冲区

    while(moudle->STATUS.B.RXFIFOLEVEL == 0);                   // 等待接收完毕

    data = (uint16)IfxQspi_readReceiveFifo(moudle);             // 保存接收到的数据

    IfxQspi_writeBasicConfigurationEndStream(moudle, bacon[spi_n].U);  // 发送数据后CS拉高

    IfxQspi_writeTransmitFifo(moudle, 0);                       // 将发送的数据写入缓冲区

    while(moudle->STATUS.B.RXFIFOLEVEL == 0);                   // 等待接收完毕

    data = ((data << 8) | (uint16)IfxQspi_readReceiveFifo(moudle));             // 拟合接收到的数据

    while(moudle->STATUS.B.PT1F == 0);                          // 等待结束标志位

    IfxQspi_clearAllEventFlags(moudle);                         // 清除发送结束标志位

