citiao1/my_code/智能车/STC32G12K128_BLDC_Project-master/【例程】控制无刷电机的示例/TC212/Seekfree_TC212_Brushless_Electric_Regulating_Demo/libraries/zf_driver/zf_driver_spi.c
        if(read_buffer != NULL)
        {
            while(moudle->STATUS.B.RXFIFOLEVEL == 0);               // 等待接收完毕
            *read_buffer = ((uint16)IfxQspi_readReceiveFifo(moudle) & 0x00FF);          // 保存接收到的数据
        }
        else
        {
            while(moudle->STATUS.B.TXFIFOLEVEL != 0);               // 等待发送完毕
        }

        if(len == 1)
        {
            IfxQspi_writeBasicConfigurationEndStream(moudle, bacon[spi_n].U);                  // 发送数据后CS拉高
        }

        IfxQspi_writeTransmitFifo(moudle, (uint8)(*write_buffer & 0x00FF));             // 将发送的数据写入缓冲区

        if(read_buffer != NULL)
        {
            while(moudle->STATUS.B.RXFIFOLEVEL == 0);               // 等待接收完毕
            *read_buffer = (*read_buffer << 8) | (uint16)IfxQspi_readReceiveFifo(moudle);// 保存接收到的数据
        }
        else
        {
            while(moudle->STATUS.B.TXFIFOLEVEL != 0);               // 等待发送完毕
        }

        write_buffer ++;
        read_buffer ++;
    }while(-- len);

    while(moudle->STATUS.B.PT1F == 0);                              // 等待结束标志位

    IfxQspi_clearAllEventFlags(moudle);                             // 清除发送结束标志位
}

//-------------------------------------------------------------------------------------------------------------------
//  函数简介      SPI初始化
//  参数说明      spi_n           选择SPI模块(SPI_1-SPI_4)
//  参数说明      mode            SPI模式 0：CPOL=0 CPHA=0    1：CPOL=0 CPHA=1   2：CPOL=1 CPHA=0   3：CPOL=1 CPHA=1  // 具体细节可自行查阅资料
//  参数说明      baud            设置SPI的波特率
//  参数说明      cs_pin          选择SPI片选引脚
//  参数说明      sck_pin         选择SPI时钟引脚
//  参数说明      mosi_pin        选择SPI MOSI引脚
//  参数说明      miso_pin        选择SPI MISO引脚
//  返回参数      void
//  使用示例      spi_init(SPI_2, SPI_MODE0, 1*1000*1000, SPI2_SCLK_P15_3, SPI2_MOSI_P15_5, SPI2_MISO_P15_4, SPI2_CS0_P15_2); // 硬件SPI初始化  模式0 波特率为1Mhz
//  备注信息
//-------------------------------------------------------------------------------------------------------------------
void spi_init (spi_index_enum spi_n, spi_mode_enum mode, uint32 baud, spi_sck_pin_enum sck_pin, spi_mosi_pin_enum mosi_pin, spi_miso_pin_enum miso_pin, spi_cs_pin_enum cs_pin)
{
    IfxQspi_SpiMaster_Config MasterConfig;
    IfxQspi_SpiMaster MasterHandle;
    IfxQspi_SpiMaster_Channel MasterChHandle;
    IfxQspi_SpiMaster_Pins MasterPins;
    IfxQspi_SpiMaster_Output SlsoPin;
    IfxQspi_SpiMaster_ChannelConfig MasterChConfig;
    volatile Ifx_QSPI *moudle;

    // 检查引脚是否正确
    // 如果从此处进入断言，则说明初始化SPI时，模块号和引脚并不是同一模块
    zf_assert(spi_n == (sck_pin / 100));
    zf_assert(spi_n == (mosi_pin / 100));
    zf_assert(spi_n == (miso_pin / 100));
    if(SPI_CS_NULL != cs_pin)
    {
        zf_assert(spi_n == (cs_pin / 100));
    }
    spi_cs_pin  = cs_pin;

    moudle = IfxQspi_getAddress((IfxQspi_Index)spi_n);

    spi_mux(spi_n, sck_pin, mosi_pin, miso_pin, cs_pin, &MasterPins, &SlsoPin);

    IfxQspi_SpiMaster_initModuleConfig(&MasterConfig, moudle);
    MasterConfig.base.mode              = SpiIf_Mode_master;
    MasterConfig.base.maximumBaudrate   = MAX_BAUD;
    MasterConfig.base.isrProvider       = IfxSrc_Tos_cpu0;

    MasterConfig.pins = &MasterPins;
    IfxQspi_SpiMaster_initModule(&MasterHandle, &MasterConfig);
    IfxQspi_SpiMaster_initChannelConfig(&MasterChConfig, &MasterHandle);

    MasterChConfig.base.baudrate = (float)baud;
    switch(mode)
    {
        case 0:
        {
            MasterChConfig.base.mode.clockPolarity = SpiIf_ClockPolarity_idleLow;                       // CPOL
            MasterChConfig.base.mode.shiftClock    = SpiIf_ShiftClock_shiftTransmitDataOnTrailingEdge;  // CPHA
        }break;
        case 1:
        {
            MasterChConfig.base.mode.clockPolarity = SpiIf_ClockPolarity_idleLow;
            MasterChConfig.base.mode.shiftClock    = SpiIf_ShiftClock_shiftTransmitDataOnLeadingEdge;
        }break;
        case 2:
        {
            MasterChConfig.base.mode.clockPolarity = SpiIf_ClockPolarity_idleHigh;
            MasterChConfig.base.mode.shiftClock    = SpiIf_ShiftClock_shiftTransmitDataOnTrailingEdge;
        }break;
        case 3:
        {
            MasterChConfig.base.mode.clockPolarity = SpiIf_ClockPolarity_idleHigh;
            MasterChConfig.base.mode.shiftClock    = SpiIf_ShiftClock_shiftTransmitDataOnLeadingEdge;
        }break;
    }

    MasterChConfig.base.mode.dataHeading    = SpiIf_DataHeading_msbFirst;
    MasterChConfig.base.mode.dataWidth      = 8;
    MasterChConfig.base.mode.csActiveLevel  = Ifx_ActiveState_low;
    MasterChConfig.sls.output               = SlsoPin;
    if(SPI_CS_NULL == cs_pin)
    {
        MasterChConfig.base.mode.loopback   = 1;
    }
    IfxQspi_SpiMaster_initChannel(&MasterChHandle, &MasterChConfig);

    if(SPI_CS_NULL == cs_pin)
    {
        IfxQspi_SpiMaster *handle   = MasterChConfig.base.driver->driver;
        Ifx_QSPI          *qspiSFR  = handle->qspi;
        qspiSFR->GLOBALCON.B.LB     = 0;
        IfxQspi_setSlaveSelectOutputControl(moudle, IfxQspi_ChannelId_0, FALSE, FALSE);
        spi_cs_pin                  = SPI_CS_NULL;
        switch(spi_n)
        {
            case SPI_0: cs_pin      = SPI0_CS0_P20_8; break;
            case SPI_1: cs_pin      = SPI1_CS0_P20_8; break;
            case SPI_2: cs_pin      = SPI2_CS0_P15_2; break;
            case SPI_3: cs_pin      = SPI3_CS0_P02_4; break;
        }
    }

    IfxQspi_configPT1Event(moudle, IfxQspi_PhaseTransitionEvent_endOfFrame);

    bacon[spi_n].U = moudle->BACON.U;
    bacon[spi_n].B.DL      = 7;        // Data Length
    bacon[spi_n].B.IDLE    = 1;        // Idle Delay Length
    bacon[spi_n].B.IPRE    = 1;        // Prescaler for the Idle Delay
    bacon[spi_n].B.LEAD    = 1;        // Leading Delay Length
    bacon[spi_n].B.LPRE    = 1;        // Prescaler for the Leading Delay
    bacon[spi_n].B.MSB     = 1;        // Shift MSB or LSB First
    bacon[spi_n].B.PARTYP  = 0;        // Parity Type
    bacon[spi_n].B.BYTE    = 0;        // Byte
    bacon[spi_n].B.TRAIL   = 1;        // Trailing Delay Length
    bacon[spi_n].B.TPRE    = 1;        // Prescaler for the Trailing Delay
    bacon[spi_n].B.CS      = cs_pin%102/6-3;
}

